In [29]:
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [2]:
dict1 = {"Name":["Dan","Elizabeth","Jon","Maria","Mark","Bill","Jess","Julia","Jeff","Ben"],
         "Salary":[40000,32000,45000,54000,72000,62000,92000,55000,35000,48000],
         "Country":["USA","Brazil","Italy","USA","USA","Brazil","Italy","USA","Italy","Brazil"]
}

In [5]:
df = pd.DataFrame(dict1)

In [6]:
df

        Name  Salary Country
0        Dan   40000     USA
1  Elizabeth   32000  Brazil
2        Jon   45000   Italy
3      Maria   54000     USA
4       Mark   72000     USA
5       Bill   62000  Brazil
6       Jess   92000   Italy
7      Julia   55000     USA
8       Jeff   35000   Italy
9        Ben   48000  Brazil

In [10]:
csv_1 = df.to_csv("salary.csv")

In [13]:
pd.read_csv("salary.csv")

   Unnamed: 0       Name  Salary Country
0           0        Dan   40000     USA
1           1  Elizabeth   32000  Brazil
2           2        Jon   45000   Italy
3           3      Maria   54000     USA
4           4       Mark   72000     USA
5           5       Bill   62000  Brazil
6           6       Jess   92000   Italy
7           7      Julia   55000     USA
8           8       Jeff   35000   Italy
9           9        Ben   48000  Brazil

In [17]:
mean = df["Salary"].mean()
mean

53500.0

In [19]:
median = df["Salary"].median()
median

51000.0

In [18]:
mode = df["Salary"].mode()
mode

0    32000
1    35000
2    40000
3    45000
4    48000
5    54000
6    55000
7    62000
8    72000
9    92000
dtype: int64

In [20]:
min_sal = df["Salary"].min()
min_sal

32000

In [22]:
max_sal = df["Salary"].max()
max_sal

92000

In [23]:
sum_salary = df["Salary"].sum()
sum_salary

535000

In [24]:
countrywise_sum = df.groupby(["Country"])["Salary"].sum()
countrywise_sum

Country
Brazil    142000
Italy     172000
USA       221000
Name: Salary, dtype: int64

In [25]:
countrywise_count = df.groupby(["Country"]).count()
countrywise_count

         Name  Salary
Country
Brazil      3       3
Italy       3       3
USA         4       4

In [26]:
var1 = df["Salary"].var()
var1

332055555.5555556

In [27]:
std1 = df["Salary"].std()
std1

18222.391598128816

In [30]:
skew1 = df.skew(axis = 0, skipna = True)
skew1

Salary    1.021551
dtype: float64

## Covariance and Correlation

In [34]:
dict2 = {
    "Infant ID":[1,2,3,4,5],
    "Gestational Age (Weeks)":[34.7,36.0,29.3,40.1,35.7],
    "Birth Weight (Grams)":[1895, 2030, 1440, 2835, 3090]
}

In [35]:
df1 = pd.DataFrame(dict2)
df1

   Infant ID  Gestational Age (Weeks)  Birth Weight (Grams)
0          1                     34.7                  1895
1          2                     36.0                  2030
2          3                     29.3                  1440
3          4                     40.1                  2835
4          5                     35.7                  3090

In [37]:
csv_2 = df1.to_csv("BirthDate.csv")

In [38]:
pd.read_csv("BirthDate.csv")

   Unnamed: 0  Infant ID  Gestational Age (Weeks)  Birth Weight (Grams)
0           0          1                     34.7                  1895
1           1          2                     36.0                  2030
2           2          3                     29.3                  1440
3           3          4                     40.1                  2835
4           4          5                     35.7                  3090

In [40]:
df1.set_index('Infant ID', inplace = True)
df1.head()

           Gestational Age (Weeks)  Birth Weight (Grams)
Infant ID
1                             34.7                  1895
2                             36.0                  2030
3                             29.3                  1440
4                             40.1                  2835
5                             35.7                  3090